"""
Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
Пример:
- пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)
"""
a = int(input('N: '))
c = []

for k in range(1, a + 1):
    if k == 1:
        c.append(k)
    else:
        c.append(k * c[-1])
print(f'N = {a}, {c}')