"""
Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.
Пример:
- Для n = 3: {1: 2.0, 2: 2.25, 3: 2.37 }
"""
n = int(input('N: '))
a = {}
for i in range(1, n + 1):
    a[i] = round((1 + 1/i) ** i, 2)
print(a)
print(f"{sum(a.values())}")
